{"config": [{"config": {"name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 16], "trainable": true, "activity_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 10}, "class_name": "Dense"}, {"config": {"name": "compressed_layer", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "sigmoid", "units": 6}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "sigmoid", "units": 10}, "class_name": "Dense"}, {"config": {"name": "uncompressed_layer", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "sigmoid", "units": 16}, "class_name": "Dense"}], "keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential"}