{"config": [{"config": {"batch_input_shape": [null, 2], "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "sigmoid", "units": 4, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "sigmoid", "units": 1, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential"}